# HydraulicDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..HydraulicDiameter Property
DuctPressureDropData Class See Also
---
The hydraulic diameter of the duct. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double HydraulicDiameter { get; set; }
```

Visual Basic
---
```text
Public Property HydraulicDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HydraulicDiameter {
	double get ();
	void set (double value);
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace